# IgnoreImports Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RouteAnalysisSettings..::..IgnoreImports Property
RouteAnalysisSettings Class See Also
---
If true, import instances are ignored by route calculation. For imports to be ignored, also EnableIgnoredCategoryIds must be set to true.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool IgnoreImports { get; set; }
```

Visual Basic
---
```text
Public Property IgnoreImports As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IgnoreImports {
	bool get ();
	void set (bool value);
}
```

# See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace